[Killed] Negate expression
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:7:17
     {
         public string AnalyzeHeartRate(int baselineHr, int currentHr, int exposureSeconds)
         {
-            if (baselineHr < 0 || currentHr < 0)
+            if (!(baselineHr < 0 || currentHr < 0))
                 return "Invalid Data";
 
killedBy: SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsMildAnxiety; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsModerateAnxiety; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsSevereAnxiety

[Killed] Equality mutation
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:7:17
     {
         public string AnalyzeHeartRate(int baselineHr, int currentHr, int exposureSeconds)
         {
-            if (baselineHr < 0 || currentHr < 0)
+            if (baselineHr > 0 || currentHr < 0)
                 return "Invalid Data";
 
killedBy: SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsMildAnxiety; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsModerateAnxiety; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsSevereAnxiety

[Killed] Negate expression
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:11:17
                 return "Invalid Data";
 
             // If exposure is very short, heart rate spike might be an anomaly
-            if (exposureSeconds <= 5)
+            if (!(exposureSeconds <= 5))
             {
                 return "Insufficient Data";
killedBy: SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsMildAnxiety; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsModerateAnxiety; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsSevereAnxiety

[Killed] Equality mutation
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:11:17
                 return "Invalid Data";
 
             // If exposure is very short, heart rate spike might be an anomaly
-            if (exposureSeconds <= 5)
+            if (exposureSeconds > 5)
             {
                 return "Insufficient Data";
killedBy: SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsMildAnxiety; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsModerateAnxiety; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsSevereAnxiety

[Killed] Arithmetic mutation
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:16:24
                 return "Insufficient Data";
             }
 
-            int diff = currentHr - baselineHr;
+            int diff = currentHr + baselineHr;
 
             // This is the condition where we can introduce a boundary bug or logical bug
killedBy: SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsMildAnxiety; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsModerateAnxiety; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsCalm

[Killed] Negate expression
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:19:17
             int diff = currentHr - baselineHr;
 
             // This is the condition where we can introduce a boundary bug or logical bug
-            if (diff >= 30 && exposureSeconds > 15)
+            if (!(diff >= 30 && exposureSeconds > 15))
             {
                 return "Severe Anxiety";
killedBy: SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsMildAnxiety; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsModerateAnxiety; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsSevereAnxiety

[Killed] Equality mutation
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:19:31
             int diff = currentHr - baselineHr;
 
             // This is the condition where we can introduce a boundary bug or logical bug
-            if (diff >= 30 && exposureSeconds > 15)
+            if (diff >= 30 && exposureSeconds < 15)
             {
                 return "Severe Anxiety";
killedBy: SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsSevereAnxiety

[Killed] Equality mutation
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:23:22
             {
                 return "Severe Anxiety";
             }
-            else if (diff >= 15)
+            else if (diff < 15)
             {
                 return "Moderate Anxiety";
killedBy: SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsMildAnxiety; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsModerateAnxiety; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsCalm

[Killed] Negate expression
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:23:22
             {
                 return "Severe Anxiety";
             }
-            else if (diff >= 15)
+            else if (!(diff >= 15))
             {
                 return "Moderate Anxiety";
killedBy: SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsMildAnxiety; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsModerateAnxiety; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsCalm

[Killed] Equality mutation
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:27:22
             {
                 return "Moderate Anxiety";
             }
-            else if (diff > 5)
+            else if (diff < 5)
             {
                 return "Mild Anxiety";
killedBy: SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsMildAnxiety; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsCalm

[Killed] Negate expression
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:27:22
             {
                 return "Moderate Anxiety";
             }
-            else if (diff > 5)
+            else if (!(diff > 5))
             {
                 return "Mild Anxiety";
killedBy: SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsMildAnxiety; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.AnalyzeHeartRate_ReturnsCalm

[Killed] Logical mutation
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:39:17
 
         public bool IsSessionValid(int totalExposureSeconds, int averageHr)
         {
-            if (totalExposureSeconds >= 60 && averageHr > 50)
+            if (totalExposureSeconds >= 60 || averageHr > 50)
             {
                 return true;
killedBy: SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.IsSessionValid_ReturnsFalse

[Killed] Negate expression
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:39:17
 
         public bool IsSessionValid(int totalExposureSeconds, int averageHr)
         {
-            if (totalExposureSeconds >= 60 && averageHr > 50)
+            if (!(totalExposureSeconds >= 60 && averageHr > 50))
             {
                 return true;
killedBy: SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.IsSessionValid_ReturnsFalse; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.IsSessionValid_ReturnsTrue

[Killed] Equality mutation
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:48:17
 
         public double CalculateAnxietyScore(int peakHr, int baselineHr)
         {
-            if (peakHr <= baselineHr)
+            if (peakHr > baselineHr)
                 return 0.0;
             
killedBy: SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.CalculateAnxietyScore_ReturnsScore; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.CalculateAnxietyScore_ReturnsZero

[Killed] Negate expression
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:48:17
 
         public double CalculateAnxietyScore(int peakHr, int baselineHr)
         {
-            if (peakHr <= baselineHr)
+            if (!(peakHr <= baselineHr))
                 return 0.0;
             
killedBy: SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.CalculateAnxietyScore_ReturnsScore; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.CalculateAnxietyScore_ReturnsZero

[Killed] Arithmetic mutation
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:51:20
             if (peakHr <= baselineHr)
                 return 0.0;
             
-            return (peakHr - baselineHr) * 1.5;
+            return (peakHr - baselineHr) / 1.5;
         }
 
killedBy: SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.CalculateAnxietyScore_ReturnsScore

[Killed] Arithmetic mutation
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:51:21
             if (peakHr <= baselineHr)
                 return 0.0;
             
-            return (peakHr - baselineHr) * 1.5;
+            return (peakHr + baselineHr) * 1.5;
         }
 
killedBy: SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.CalculateAnxietyScore_ReturnsScore

[Killed] Equality mutation
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:56:20
 
         public bool NeedsIntervention(int currentHr, int maxSafeHr)
         {
-            return currentHr >= maxSafeHr; // Vulnerable to >= vs > mutation
+            return currentHr < maxSafeHr; // Vulnerable to >= vs > mutation
         }
     }
killedBy: SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.NeedsIntervention_ReturnsTrue; SimulatedTherapyLogic.Tests.VitalsAnalyzerTests.NeedsIntervention_ReturnsFalse

[Survived] Equality mutation
PhobiaReliefTherapy/MutationAssignment/SimulatedTherapyLogic/VitalsAnalyzer.cs:56:20
 
         public bool NeedsIntervention(int currentHr, int maxSafeHr)
         {
-            return currentHr >= maxSafeHr; // Vulnerable to >= vs > mutation
+            return currentHr > maxSafeHr; // Vulnerable to >= vs > mutation
         }
     }
